CREATE TABLE Departments
(
    Id INT PRIMARY KEY IDENTITY,
    Name NVARCHAR(255) UNIQUE,
    ParentDepartmentId INT
);

CREATE TABLE Workers
(
    Id INT PRIMARY KEY IDENTITY,
    DepartmentId INT,
    FOREIGN KEY (DepartmentId) REFERENCES Departments(Id),
    FirstName NVARCHAR(255),
    MidName NVARCHAR(255),
    LastName NVARCHAR(255),
    PersonnelNumber INT UNIQUE
);

INSERT INTO Departments (Name, ParentDepartmentId)
VALUES
    ('Отдел по обслуживанию клиентов', NULL),
    ('Отдел продаж', 1),
    ('Отдел оптовых продаж', 2),
    ('Отдел розничных продаж', 2),
    ('Отдел логистики', 1),
    ('Склад', 5),
    ('Отдел доставки', 5),
    ('Производственный отдел', NULL),
    ('Инженерный отдел', 8),
    ('Отдел проверки качества', 8),
    ('Отдел закупок', 8),
    ('Бухгалтерия', NULL);

INSERT INTO Workers (DepartmentId, FirstName, MidName, LastName, PersonnelNumber)
VALUES
    (1, 'Иван', 'Иванович', 'Петров', 1001),
    (2, 'Алексей', 'Алексеевич', 'Сидоров', 2001),
    (3, 'Ольга', 'Владимировна', 'Иванова', 3001),
    (3, 'Екатерина', 'Дмитриевна', 'Смирнова', 3002),
    (4, 'Дмитрий', 'Сергеевич', 'Козлов', 4001),
    (4, 'Анна', 'Александровна', 'Морозова', 4002),
    (5, 'Сергей', 'Дмитриевич', 'Волков', 5001),
    (6, 'Мария', 'Александровна', 'Зайцева', 6001),
    (6, 'Артем', 'Игоревич', 'Федоров', 6002),
    (7, 'Андрей', 'Сергеевич', 'Кузнецов', 7001),
    (7, 'Елена', 'Викторовна', 'Соколова', 7002),
    (7, 'Алиса', 'Алексеевна', 'Павлова', 7003),
    (7, 'Максим', 'Иванович', 'Николаев', 7004),
    (7, 'Дарья', 'Александровна', 'Морозова', 7005),
    (8, 'Виктор', 'Алексеевич', 'Васильев', 8001),
    (9, 'Анатолий', 'Иванович', 'Петров', 9001),
    (9, 'Евгения', 'Александровна', 'Сидорова', 9002),
    (9, 'Павел', 'Дмитриевич', 'Иванов', 9003),
    (9, 'Алина', 'Алексеевна', 'Смирнова', 9004),
    (10, 'Ирина', 'Владимировна', 'Козлова', 10001),
    (10, 'Александр', 'Дмитриевич', 'Морозов', 10002),
    (11, 'Анна', 'Александровна', 'Волкова', 11001),
    (12, 'Михаил', 'Сергеевич', 'Зайцев', 12001),
    (12, 'Елизавета', 'Алексеевна', 'Федорова', 12002);